In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# Объект Series

In [3]:
obj = Series([4,7,-5,3])
obj2 = Series([4, 7, -5, 3], index=['d', 'Ь', 'а', 'с'])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj2

d    4
Ь    7
а   -5
с    3
dtype: int64

**Для выборки одного или нескольких элементов из объекта Series можно использовать значения индекса**

In [6]:
obj = Series([4,7,-5,3])
obj2[[1, 2, 3]]

C:\Users\Daily\AppData\Local\Temp\ipykernel_16740\1845565386.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[1, 2, 3]]

Ь    7
а   -5
с    3
dtype: int64

**C Series'ами можно производить фильтрацию с помощью булева массива, скалярное умножение и применение математических функций.**

In [7]:
obj2[obj2 > 0]

d    4
Ь    7
с    3
dtype: int64

In [8]:
obj2 * 2

d     8
Ь    14
а   -10
с     6
dtype: int64

In [9]:
np.exp(obj)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
dtype: float64

**Объект Series можно также представлять себе как упорядоченный словарь фиксированной длины, поскольку он отображает индекс на данные. Его можно передавать многим функциям, ожидающим получить словарь.**

In [10]:
sdata = { 'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

### Полезные методы Series

```
obj_example = Series(data)
obj_example.isnull() 
obj_example.notnull()
```

# Объект DataFrame

In [11]:
data = {"city": ["Барнаул","Новокузнецк","Онталия", "Благовещенск","Якутск"],
		"year": [2000, 2001, 2002,2001, 2002],
		"pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
data_frame = pd.DataFrame(data)
data_frame

           city  year  pop
0       Барнаул  2000  1.5
1   Новокузнецк  2001  1.7
2       Онталия  2002  3.6
3  Благовещенск  2001  2.4
4        Якутск  2002  2.9

In [12]:
data_frame["city"]

0         Барнаул
1     Новокузнецк
2         Онталия
3    Благовещенск
4          Якутск
Name: city, dtype: object

**Если передать конструктору DataFrame словарь словарей , то ключи внешнего словаря будут интерпретированы как столбцы, а ключи внутреннего словаря - как индексы строк.**

In [13]:
data = {"nevada": {2001:2.4, 2002: 2.9}, "ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}
data_frame = DataFrame(data)
data_frame

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

**Результат можно транспонировать**

In [14]:
data_frame.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

## Что можно передать в DataFrame


| Тип                                    | Примечания                                                                                                            |
| -------------------------------------- | --------------------------------------------------------------------------------------------------------------------- |
| Двумерный ndarray                      | Матрица данных, дополнительно можно передать метки строк и стольцов                                                   |
| Словарь массивов, списков или кортежей | Каждая последовательность становиться столбцом объекта DataFrame. Все последовательности должны быть одинаковой длины |
| Словарь объектов Series                | Каждое значение становится столбцом. Ключ объединяются и образуют индексы строк результата                            |
| Словарь словарей                       | Каждый внутренний словарь становится столбцом. Ключи - индексы строк                                                  |
| Список словарей или список Series      | Каждый элемент списка становится строкой объекта DataFrame.                                                           |

# Базовая функциональность

## Переиндексация DataFrame

In [15]:
data_frame = DataFrame([[1,2,3],[4,5,6],[7,8,9]], index =['a','c','d'],columns=["Абхазия","Испания","Юар"])
data_frame

   Абхазия  Испания  Юар
a        1        2    3
c        4        5    6
d        7        8    9

In [16]:
data_frame_2 = data_frame.reindex(['a','b','c','d'])
data_frame_2

   Абхазия  Испания  Юар
a      1.0      2.0  3.0
b      NaN      NaN  NaN
c      4.0      5.0  6.0
d      7.0      8.0  9.0

In [17]:
data_frame_3 = data_frame.reindex(columns=["Абхазия", "Ispania","Юар"])
data_frame_3

   Абхазия  Ispania  Юар
a        1      NaN    3
c        4      NaN    6
d        7      NaN    9

## Удаление элементов из DataFrame

In [18]:
data = {"city": ["Барнаул","Новокузнецк","Онталия", "Благовещенск","Якутск"],
		"year": [2000, 2001, 2002,2001, 2002],
		"pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
data_frame = pd.DataFrame(data)
data_frame.drop([0,3])

          city  year  pop
1  Новокузнецк  2001  1.7
2      Онталия  2002  3.6
4       Якутск  2002  2.9

In [19]:
data = {"city": ["Барнаул","Новокузнецк","Онталия", "Благовещенск","Якутск"],
		"year": [2000, 2001, 2002,2001, 2002],
		"pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
data_frame = pd.DataFrame(data)
data_frame.drop(["year"], axis=1)

           city  pop
0       Барнаул  1.5
1   Новокузнецк  1.7
2       Онталия  3.6
3  Благовещенск  2.4
4        Якутск  2.9

## Доступ по индексу

In [20]:
data = {"city": ["Барнаул","Новокузнецк","Онталия", "Благовещенск","Якутск"],
		"year": [2000, 2001, 2002,2001, 2002],
		"pop": [1.5, 1.7, 3.6, 2.4, 2.9]}
data_frame = pd.DataFrame(data)
data_frame["city"]

0         Барнаул
1     Новокузнецк
2         Онталия
3    Благовещенск
4          Якутск
Name: city, dtype: object

In [21]:
data_frame[:2]

          city  year  pop
0      Барнаул  2000  1.5
1  Новокузнецк  2001  1.7

In [22]:
data_frame[data_frame["year"]>2001]

      city  year  pop
2  Онталия  2002  3.6
4   Якутск  2002  2.9

## Булев DataFrame

In [23]:
data_frame = DataFrame(np.arange(16).reshape(4,4))
data_frame

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
data_frame < 5

       0      1      2      3
0   True   True   True   True
1   True  False  False  False
2  False  False  False  False
3  False  False  False  False

In [25]:
data_frame[data_frame < 5] = 0
data_frame

    0   1   2   3
0   0   0   0   0
1   0   5   6   7
2   8   9  10  11
3  12  13  14  15

## Арифметические операции

In [26]:
df_1 = DataFrame(np.arange(9.) . reshape((3, 3)), columns=list('bcd'),index = ['A1', 'B2', 'C3'])
df_2 = DataFrame(np.arange(12.) . reshape((4, 3)), columns=list('bde'),index = ['A1', 'B2', 'C3','C4'])

In [27]:
df_1

      b    c    d
A1  0.0  1.0  2.0
B2  3.0  4.0  5.0
C3  6.0  7.0  8.0

In [28]:
df_2

      b     d     e
A1  0.0   1.0   2.0
B2  3.0   4.0   5.0
C3  6.0   7.0   8.0
C4  9.0  10.0  11.0

In [29]:
df_1.add(df_2)

       b   c     d   e
A1   0.0 NaN   3.0 NaN
B2   6.0 NaN   9.0 NaN
C3  12.0 NaN  15.0 NaN
C4   NaN NaN   NaN NaN

In [30]:
df_1.add(df_2,fill_value=0)

       b    c     d     e
A1   0.0  1.0   3.0   2.0
B2   6.0  4.0   9.0   5.0
C3  12.0  7.0  15.0   8.0
C4   9.0  NaN  10.0  11.0

## Применение функций

In [31]:
df_1 = DataFrame(np.random.randn(4,3), columns=list('bcd'),index = ['A1', 'B2', 'C3','C4'])
df_1

           b         c         d
A1 -1.270191  0.036260  0.147872
B2  1.612912 -0.811186  1.056719
C3  0.616498 -0.569704 -0.189336
C4  0.108730  0.412877  0.675580

In [32]:
df_1.abs()

           b         c         d
A1  1.270191  0.036260  0.147872
B2  1.612912  0.811186  1.056719
C3  0.616498  0.569704  0.189336
C4  0.108730  0.412877  0.675580

In [33]:
def func_1(x):
    return x.max() - x.min()
df_1.apply(func_1, axis=1)

A1    1.418063
B2    2.424098
C3    1.186203
C4    0.566850
dtype: float64

In [34]:
df_1.apply(func_1)

b    2.883103
c    1.224063
d    1.246055
dtype: float64

In [35]:
def func_2(x):
    return x + 2
df_1

           b         c         d
A1 -1.270191  0.036260  0.147872
B2  1.612912 -0.811186  1.056719
C3  0.616498 -0.569704 -0.189336
C4  0.108730  0.412877  0.675580

In [36]:
df_1.map(func_2)

           b         c         d
A1  0.729809  2.036260  2.147872
B2  3.612912  1.188814  3.056719
C3  2.616498  1.430296  1.810664
C4  2.108730  2.412877  2.675580

## Сортировка

In [37]:
df_1 = DataFrame(np.random.randn(4,3), columns=list('bcd'),index = ['A1', 'B2', 'C3','C4'])
df_1

           b         c         d
A1  0.271046 -0.317017  1.325888
B2  0.668563 -0.639540  0.107553
C3 -0.412308 -1.203567 -0.093861
C4 -1.332484  0.570354  2.374450

In [38]:
df_1.sort_index()

           b         c         d
A1  0.271046 -0.317017  1.325888
B2  0.668563 -0.639540  0.107553
C3 -0.412308 -1.203567 -0.093861
C4 -1.332484  0.570354  2.374450

In [39]:
df_1.sort_index(axis=1)

           b         c         d
A1  0.271046 -0.317017  1.325888
B2  0.668563 -0.639540  0.107553
C3 -0.412308 -1.203567 -0.093861
C4 -1.332484  0.570354  2.374450

In [40]:
df_1.sort_index(axis=1, ascending=False)

           d         c         b
A1  1.325888 -0.317017  0.271046
B2  0.107553 -0.639540  0.668563
C3 -0.093861 -1.203567 -0.412308
C4  2.374450  0.570354 -1.332484

In [41]:
df = DataFrame({'b': [4,7,-3,2] , 'a': [0,1,0,1]})
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [42]:
df.sort_values(['a','b'],ascending=(False,False))

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0

## Уникальные значения, счетчики значений и членство

In [43]:
df = DataFrame({'b': [4,7,-3,2] , 'a': [0,1,0,1]})
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [44]:
df["a"].unique()

array([0, 1], dtype=int64)

In [45]:
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [46]:
df["a"].value_counts()

a
0    2
1    2
Name: count, dtype: int64

In [47]:
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [48]:
df["a"].isin([0,2])

0     True
1    False
2     True
3    False
Name: a, dtype: bool

In [49]:
df[df["a"].isin([0,2])]

   b  a
0  4  0
2 -3  0

In [50]:
df[~df["a"].isin([0,2])]

   b  a
1  7  1
3  2  1

# Обработка и фильтрация отсутствующих данных

## Фильтрация

In [51]:
df = DataFrame({"a": [1,2,None,None],"b":[0,0,0,0],"c":[np.nan, "Yes", "No","Yes"]})
df

     a  b    c
0  1.0  0  NaN
1  2.0  0  Yes
2  NaN  0   No
3  NaN  0  Yes

In [52]:
df["c"].isnull()

0     True
1    False
2    False
3    False
Name: c, dtype: bool

In [53]:
df["c"].notnull()

0    False
1     True
2     True
3     True
Name: c, dtype: bool

In [54]:
df

     a  b    c
0  1.0  0  NaN
1  2.0  0  Yes
2  NaN  0   No
3  NaN  0  Yes

In [55]:
df["a"].dropna()

0    1.0
1    2.0
Name: a, dtype: float64

In [56]:
df.dropna()

     a  b    c
1  2.0  0  Yes

df.dropna(how="all")

In [57]:
df = DataFrame(np.random.randn( 7, 3))
df.loc[:4, 1] = None
df.loc[:2, 2] = None
df

          0         1         2
0 -0.760218       NaN       NaN
1 -1.585925       NaN       NaN
2  1.774582       NaN       NaN
3  1.316343       NaN  0.243461
4 -0.531889       NaN  0.714078
5 -0.039674 -0.644155  1.188959
6  1.744586 -0.477569 -2.045684

In [58]:
df.dropna(thresh=3)

          0         1         2
5 -0.039674 -0.644155  1.188959
6  1.744586 -0.477569 -2.045684

## Заполнение пропусков

In [59]:
df = DataFrame(np.random.randn( 7, 3))
df.loc[:4, 1] = None
df.loc[:2, 2] = None
df

          0         1         2
0  0.156605       NaN       NaN
1  1.201381       NaN       NaN
2  0.195668       NaN       NaN
3  0.199645       NaN  0.672770
4  1.166328       NaN -0.277399
5 -1.288952  1.519116 -0.492846
6 -0.909353 -0.824320  1.170767

In [60]:
df.fillna(0)

          0         1         2
0  0.156605  0.000000  0.000000
1  1.201381  0.000000  0.000000
2  0.195668  0.000000  0.000000
3  0.199645  0.000000  0.672770
4  1.166328  0.000000 -0.277399
5 -1.288952  1.519116 -0.492846
6 -0.909353 -0.824320  1.170767

In [61]:
df.fillna({1: -1, 2:1})

          0         1         2
0  0.156605 -1.000000  1.000000
1  1.201381 -1.000000  1.000000
2  0.195668 -1.000000  1.000000
3  0.199645 -1.000000  0.672770
4  1.166328 -1.000000 -0.277399
5 -1.288952  1.519116 -0.492846
6 -0.909353 -0.824320  1.170767

# Объединение данных merge и concat

In [62]:
df1 = pd.DataFrame({"key": ["A", "B", "C", "D"], "value": [1, 2, 3, 4]})
df1

  key  value
0   A      1
1   B      2
2   C      3
3   D      4

In [63]:
df2 = pd.DataFrame({"key": ["B", "D", "E", "F"], "value": [5, 6, 7, 8]})
df2

  key  value
0   B      5
1   D      6
2   E      7
3   F      8

In [64]:
pd.merge(df1, df2, on="key", how="inner")

  key  value_x  value_y
0   B        2        5
1   D        4        6

In [65]:
pd.concat([df1, df2], axis=0, ignore_index=True)

  key  value
0   A      1
1   B      2
2   C      3
3   D      4
4   B      5
5   D      6
6   E      7
7   F      8

In [66]:
df1.join(df2, how="inner", lsuffix="_1", rsuffix="_2")

  key_1  value_1 key_2  value_2
0     A        1     B        5
1     B        2     D        6
2     C        3     E        7
3     D        4     F        8

# Агрегация данных

## Groupby

In [67]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [68]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

## Pivot

In [69]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [70]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc="sum", fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

# Crosstab

In [71]:
df = DataFrame({"total_bill":[16,10,21,23,24],"tip":[1,1,3,3,3],
                "sex":["F","M","M","M","F"],
                "smoker":["Yes","Yes","No","Yes","Yes"],
                "day":["Sun","Sun","Sun","Sun","Sun"] ,
                "time":["Dinner","Dinner","Dinner","Dinner","Dinner"],
                "size":[2,3,3,2,4]})
df

   total_bill  tip sex smoker  day    time  size
0          16    1   F    Yes  Sun  Dinner     2
1          10    1   M    Yes  Sun  Dinner     3
2          21    3   M     No  Sun  Dinner     3
3          23    3   M    Yes  Sun  Dinner     2
4          24    3   F    Yes  Sun  Dinner     4

In [72]:
pd.crosstab(df.sex, df.smoker)

smoker  No  Yes
sex
F        0    2
M        1    2

# Работа с файлами

In [73]:
orders = pd.read_csv("orders.csv")
orders.head()

       id  order_date ship_mode customer_id    sales
0  100006  2014-09-07  Standard    DK-13375  377.970
1  100090  2014-07-08  Standard    EB-13705  699.192
2  100293  2014-03-14  Standard    NF-18475   91.056
3  100328  2014-01-28  Standard    JC-15340    3.928
4  100363  2014-04-08  Standard    JM-15655   21.376

In [74]:
orders.groupby(["ship_mode"])["sales"].sum().reset_index()

  ship_mode         sales
0     First  3.514284e+05
1  Same Day  1.283631e+05
2    Second  4.591936e+05
3  Standard  1.358216e+06

In [75]:
orders.to_csv("orders_sum.csv")

In [76]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (3.1.2)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: et-xmlfile in c:\users\daily\documents\lessons_notebooks\venv\lib\site-packages (from openpyxl) (1.1.0)

In [77]:
import pandas as pd

df = pd.read_excel("stocks.xlsx")
df.head()

        Date   Open   High    Low  Close   Volume
0 2014-07-21  83.46  83.53  81.81  81.93  2359300
1 2014-07-18  83.30  83.40  82.52  83.35  4020800
2 2014-07-17  84.35  84.63  83.33  83.63  1974000
3 2014-07-16  83.77  84.91  83.66  84.91  1755600
4 2014-07-15  84.30  84.38  83.20  83.58  1874700

# Matplotlib

## Линейная диаграмма

In [78]:
import matplotlib.pyplot as plt
import numpy as np

# make data
x = np.linspace(0, 10, 100)
y = 4 + 2 * np.sin(2 * x)

# plot
fig, ax = plt.subplots()

ax.plot(x, y, linewidth=2.0)

ax.set(xlim=(0, 8), xticks=np.arange(1, 8),
       ylim=(0, 8), yticks=np.arange(1, 8))

plt.show()

ModuleNotFoundError: No module named 'matplotlib'

## Круговая диаграмма

In [ ]:
# Import
df_raw = pd.read_csv("https://github.com/selva86/datasets/raw/master/mpg_ggplot2.csv")

# Prepare Data
df = df_raw.groupby('class').size()

# Make the plot with pandas
df.plot(kind='pie', subplots=True, figsize=(8, 8))
plt.title("Pie Chart of Vehicle Class - Bad")
plt.ylabel("")
plt.show()

In [ ]:
df_raw = pd.read_csv("https://github.com/selva86/datasets/raw/master/mpg_ggplot2.csv")

# Prepare Data
df = df_raw.groupby('class').size().reset_index(name='counts')

# Draw Plot
fig, ax = plt.subplots(figsize=(12, 7), subplot_kw=dict(aspect="equal"), dpi= 80)

data = df['counts']
categories = df['class']
explode = [0,0,0,0,0,0.1,0]

def func(pct, allvals):
    absolute = int(pct/100.*np.sum(allvals))
    return "{:.1f}% ({:d} )".format(pct, absolute)

wedges, texts, autotexts = ax.pie(data, 
                                  autopct=lambda pct: func(pct, data),
                                  textprops=dict(color="w"), 
                                  colors=plt.cm.Dark2.colors,
                                 startangle=140,
                                 explode=explode)

# Decoration
ax.legend(wedges, categories, title="Vehicle Class", loc="center left", bbox_to_anchor=(1, 0, 0.5, 1))
plt.setp(autotexts, size=10, weight=700)
ax.set_title("Class of Vehicles: Pie Chart")
plt.show()

## Гистограмма

In [ ]:
import random

# Import Data
df_raw = pd.read_csv("https://github.com/selva86/datasets/raw/master/mpg_ggplot2.csv")

# Prepare Data
df = df_raw.groupby('manufacturer').size().reset_index(name='counts')
n = df['manufacturer'].unique().__len__()+1
all_colors = list(plt.cm.colors.cnames.keys())
random.seed(100)
c = random.choices(all_colors, k=n)

# Plot Bars
plt.figure(figsize=(16,10), dpi= 80)
plt.bar(df['manufacturer'], df['counts'], color=c, width=.5)
for i, val in enumerate(df['counts'].values):
    plt.text(i, val, float(val), horizontalalignment='center', verticalalignment='bottom', fontdict={'fontweight':500, 'size':12})

# Decoration
plt.gca().set_xticklabels(df['manufacturer'], rotation=60, horizontalalignment= 'right')
plt.title("Number of Vehicles by Manaufacturers", fontsize=22)
plt.ylabel('# Vehicles')
plt.ylim(0, 45)
plt.show()

## График временного ряда

In [ ]:
df = pd.read_csv('https://github.com/selva86/datasets/raw/master/AirPassengers.csv')

# Draw Plot
plt.figure(figsize=(16,10), dpi= 80)
plt.plot('date', 'value', data=df, color='tab:red')

# Decoration
plt.ylim(50, 750)
xtick_location = df.index.tolist()[::12]
xtick_labels = [x[-4:] for x in df.date.tolist()[::12]]
plt.xticks(ticks=xtick_location, labels=xtick_labels, rotation=0, fontsize=12, horizontalalignment='center', alpha=.7)
plt.yticks(fontsize=12, alpha=.7)
plt.title("Air Passengers Traffic (1949 - 1969)", fontsize=22)
plt.grid(axis='both', alpha=.3)

# Remove borders
plt.gca().spines["top"].set_alpha(0.0)    
plt.gca().spines["bottom"].set_alpha(0.3)
plt.gca().spines["right"].set_alpha(0.0)    
plt.gca().spines["left"].set_alpha(0.3)   
plt.show()

# Plotly

In [ ]:
import plotly
import plotly.graph_objs as go
import plotly.express as px
from plotly.subplots import make_subplots

## Линейный график

In [ ]:
x = np.arange(0, 5, 0.1)
def f(x):
    return x**2

px.scatter(x=x, y=f(x)).show()

In [ ]:
fig = go.Figure()
fig.add_trace(go.Scatter(x=x, y=f(x)))
fig.add_trace(go.Scatter(x=x, y=x))
fig.show()

## Круговая диаграмма

In [ ]:
dices = pd.DataFrame(np.random.randint(low=1, high=7, size=(100, 2)), columns=('Кость 1', 'Кость 2'))


dices['Сумма'] = dices['Кость 1'] + dices['Кость 2'] 
# Первые 5 бросков игральных костей

sum_counts = dices['Сумма'].value_counts().sort_index()

fig = go.Figure()
fig.add_trace(go.Pie(values=sum_counts, labels=sum_counts.index))
fig.show()

## Гистограмма

In [ ]:
dices2 = pd.DataFrame(np.random.randint(low=1, high=7, size=(100, 2)), columns=('Кость 1', 'Кость 2'))
dices2['Сумма'] = dices2['Кость 1'] + dices2['Кость 2']
dices3 = pd.DataFrame(np.random.randint(low=1, high=7, size=(1000, 2)), columns=('Кость 1', 'Кость 2'))
dices3['Сумма'] = dices3['Кость 1'] + dices3['Кость 2']

fig = go.Figure()
fig.add_trace(go.Histogram(x=dices['Сумма']))
fig.add_trace(go.Histogram(x=dices2['Сумма']))
fig.add_trace(go.Histogram(x=dices3['Сумма']))
fig.show()

## Фреймы

In [ ]:
fig = go.Figure()
fig.add_trace(go.Scatter(x=[x[0]], y=[f(x)[0]], mode='lines+markers',  name='f(x)=x<sup>2</sup>'))

frames=[]
for i in range(1, len(x)):
    frames.append(go.Frame(data=[go.Scatter(x=x[:i+1], y=f(x[:i+1]))]))

fig.frames = frames   

fig.update_layout(legend_orientation="h",
                  legend=dict(x=.5, xanchor="center"),
                  updatemenus=[dict(type="buttons", buttons=[dict(label="Play", method="animate", args=[None])])],
                  margin=dict(l=0, r=0, t=0, b=0))
fig.update_traces(hoverinfo="all", hovertemplate="Аргумент: %{x}<br>Функция: %{y}")
fig.show()

## Слайдер

In [ ]:
num_steps = len(x)
trace_list = [go.Scatter(visible=True, x=[x[0]], y=[f(x)[0]], mode='lines+markers', name='f(x)=x<sup>2</sup>')]

for i in range(1, len(x)):
    trace_list.append(go.Scatter(visible=False, x=x[:i+1], y=f(x[:i+1]), mode='lines+markers', name='f(x)=x<sup>2</sup>'))

fig = go.Figure(data=trace_list)

steps = []
for i in range(num_steps):
    # Hide all traces
    step = dict(
        method = 'restyle',  
        args = ['visible', [False] * len(fig.data)],
    )
    # Enable trace we want to see
    step['args'][1][i] = True
    
    # Add step to step list
    steps.append(step)

sliders = [dict(
    steps = steps,
)]

fig.layout.sliders = sliders

fig.show()